; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	Star10 - direction
	Star7 - direction
	Star8 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(pointing satellite2 Star8)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 image1)
	(have_image Star15 spectrograph0)
	(have_image Planet16 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite2 instrument2 star11)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite2 star12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star12)
   goals met: 0 of 6
4. (take_image satellite2 star12 instrument2 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 1 of 6
5. (turn_to satellite2 planet16 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet16)
   goals met: 1 of 6
6. (take_image satellite2 planet16 instrument2 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 2 of 6
7. (turn_to satellite2 phenomenon13 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 6
8. (take_image satellite2 phenomenon13 instrument2 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 3 of 6
9. (turn_to satellite2 star14 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star14)
   goals met: 3 of 6
10. (take_image satellite2 star14 instrument2 image1)
   added: (have_image star14 image1)
   goals met: 4 of 6
11. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 4 of 6
12. (take_image satellite2 star15 instrument2 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 5 of 6
13. (turn_to satellite2 star8 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star8)
   goals met: 6 of 6
